{"pageProps":{"experience":{"data":{"title":"Oracle","post":"Cloud + DevOps Engineer (Member of Technical Staff)","date":"2021 - 2023","link":"https://www.oracle.com/cloud/","image":"/img/oracle.jpg","caption":"My first developer experience in the industry out of college. Cloud + DevOps.","description":"Oracle Cloud is the first public cloud built from the ground up to be a better cloud for every application. By rethinking core engineering and systems design for cloud computing, we created innovations that solve problems that customers have with existing public clouds. We accelerate migrations of existing enterprise workloads, deliver better reliability and performance for all applications, and offer the complete services customers need to build innovative cloud applications.","tags":["Cloud","Microservices","Oracle"],"stack":["Java","Golang","Docker","Kubernetes","Terraform","Prometheus","Grafana","Oracle Cloud Infrastructure","Scripting"],"slug":"oracle","blurImage":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAQAAAADCAIAAAA7ljmRAAAACXBIWXMAAC4jAAAuIwF4pT92AAAALklEQVR4nGPY8+f/pk//t//4v/PnfwYG2UgGBjMGfmcGuRgGBq0iBp1KENKuAACFWA67+KHuSgAAAABJRU5ErkJggg=="},"content":"- Created a large-scale distributed system platform built on Oracle Kubernetes Engine enabling users to orchestrate custom Kubernetes clusters with pre-configured configurations suited to requirements.\n- Devised microservices architecture and orchestrated automation of Oracle Cloud Infrastructure(OCI) resources deployment leveraging Docker and Terraform(Infrastructure as Code tools).\n- Mentored 5 associate software engineers to develop and maintain Bitbucket CI/CD pipeline deployment processes across different environments reducing deployment failure by 90%.\n- Collaborated to build a Kubernetes Prometheus stack (kube-prometheus), including kube-state-metrics and node-exporter for cluster monitoring and observability using Golang.\n- Engineered Grafana dashboards to enable cluster administrators to query, visualize, and understand target metrics data stored in Prometheus.\n- Applied canary deployments for control plane to compare, test, and observe behavior of any update made to service using Java-based JUnit test cases.\n- Installed alarms for different OCI resources by fetching defined metrics to get notifications regarding resources health, capacity, and performance-related issues.\n- Demonstrated proficiency in incident response, system monitoring, and automation, contributing to improving system reliability and ensuring adherence to Service Level Agreement during on-call support.","source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    ul: \"ul\",\n    li: \"li\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_components.ul, {\n    children: [\"\\n\", _jsx(_components.li, {\n      children: \"Created a large-scale distributed system platform built on Oracle Kubernetes Engine enabling users to orchestrate custom Kubernetes clusters with pre-configured configurations suited to requirements.\"\n    }), \"\\n\", _jsx(_components.li, {\n      children: \"Devised microservices architecture and orchestrated automation of Oracle Cloud Infrastructure(OCI) resources deployment leveraging Docker and Terraform(Infrastructure as Code tools).\"\n    }), \"\\n\", _jsx(_components.li, {\n      children: \"Mentored 5 associate software engineers to develop and maintain Bitbucket CI/CD pipeline deployment processes across different environments reducing deployment failure by 90%.\"\n    }), \"\\n\", _jsx(_components.li, {\n      children: \"Collaborated to build a Kubernetes Prometheus stack (kube-prometheus), including kube-state-metrics and node-exporter for cluster monitoring and observability using Golang.\"\n    }), \"\\n\", _jsx(_components.li, {\n      children: \"Engineered Grafana dashboards to enable cluster administrators to query, visualize, and understand target metrics data stored in Prometheus.\"\n    }), \"\\n\", _jsx(_components.li, {\n      children: \"Applied canary deployments for control plane to compare, test, and observe behavior of any update made to service using Java-based JUnit test cases.\"\n    }), \"\\n\", _jsx(_components.li, {\n      children: \"Installed alarms for different OCI resources by fetching defined metrics to get notifications regarding resources health, capacity, and performance-related issues.\"\n    }), \"\\n\", _jsx(_components.li, {\n      children: \"Demonstrated proficiency in incident response, system monitoring, and automation, contributing to improving system reliability and ensuring adherence to Service Level Agreement during on-call support.\"\n    }), \"\\n\"]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{"title":"Oracle","post":"Cloud + DevOps Engineer (Member of Technical Staff)","date":"2021 - 2023","link":"https://www.oracle.com/cloud/","image":"/img/oracle.jpg","caption":"My first developer experience in the industry out of college. Cloud + DevOps.","description":"Oracle Cloud is the first public cloud built from the ground up to be a better cloud for every application. By rethinking core engineering and systems design for cloud computing, we created innovations that solve problems that customers have with existing public clouds. We accelerate migrations of existing enterprise workloads, deliver better reliability and performance for all applications, and offer the complete services customers need to build innovative cloud applications.","tags":["Cloud","Microservices","Oracle"],"stack":["Java","Golang","Docker","Kubernetes","Terraform","Prometheus","Grafana","Oracle Cloud Infrastructure","Scripting"],"slug":"oracle","blurImage":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAQAAAADCAIAAAA7ljmRAAAACXBIWXMAAC4jAAAuIwF4pT92AAAALklEQVR4nGPY8+f/pk//t//4v/PnfwYG2UgGBjMGfmcGuRgGBq0iBp1KENKuAACFWA67+KHuSgAAAABJRU5ErkJggg=="}}}},"__N_SSG":true}